import React from 'react';

const visual = () => {
    return (
        <div>
            {/* - 비주얼 영역은 사용자가 직접 세로로 스크롤 할 수 있어야 한다. */}
            {/* - 비주얼 영역은 최소 3개의 아이템을 사용자의 스크롤에 따라 각각 보여준다. */}
            {/* - 비주얼 영역의 아이템은 제공된 이미지와 ‘Visual.txt’를 활용하여 제작한다. */}
            {/* - 비주얼 영역에서 마우스 휠을 이용하여 상, 하로 슬라이드 되며, 스크롤이 끝났을 때 영역에 자동으로 맞춰져야 한다. (스냅 기능 구현) */}
            {/* - 비주얼 영역에는 현재 보이는 아이템의 순서를 알 수 있는 요소가 존재한다. */}

            {/* 
                정원도시 경상남도에서 추억을 남길 절호의 기회!

                지친 일상과 고생한 당신에게 최고의 휴가를 만들어 드릴게요.

                당신에게 딱 맞는 경상남도 정원은 무엇일까요?

                오솔길의 숲 향기와 꽃내음을 곱씹으며 걸어다녀보세요.

                정원을 원하는 당신, 경상남도 정원에 한 번 들려보세요.

                사시사철 다른 풍경, 다른 꽃을 보고 다른 추억을 남기세요.

                시간이 멈춘것처럼, 순간을 간직하고, 순간을 기억하세요.

                가족, 연인, 혼자라도 좋아요, 언제든 방문해 주세요.

                요즘 시대에 보기 어려운 자연을 있는 힘껏 만끽하세요.

                아름다운 풍경에 젖어보세요.

                경상남도에서 당신을 위해 멋진 정원들을 준비했어요.
            */}
            비주얼
        </div>
    );
};

export default visual;